Main_Important_Login_SignUp/Rest_Api_GetWay_Kafka_BullMq/All_Information/test/Artilly/load-test.yml
config:
  target: "http://localhost:9000"
  phases:
    - duration: 60       # Run the test for 60 seconds
      arrivalRate: 200   # Simulate 200 new users per second (total: 200 * 60 = 12,000)
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Pagination Load Test"
    flow:
      - get:
          url: "/search?page={{ $randomInt(1,1000) }}&limit=10"